Tekla Open API Reference for Tekla Structures 2025
LogicalWeld.Explode Method
 Removes the logical weld from the model but not the children welds.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Explode()
Public Function Explode As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
LogicalWeld Class
Tekla.Structures.Model Namespace